Repository: mozilla-l10n/mt-training-data
Catalog: am/am_pontoon.tmx
Source language: en_us
Languages: am

source: Popup ads are the worst. Block them with <a href="%(url)s">Popup Blocker</a> and never deal with another annoying popup again.
am: ብቅ ባይ ማስታወቂያዎች በጣም የከፋ ናቸው። በ <a href="%(url)s"> ብቅ ባይ ማገጃ </a> አግ Blockቸው እና እንደገናም ሌላ አሰቃቂ ብቅ-ባይን በጭራሽ አያነጋግሩ።

source: Powerfully private
am: ከፍተኛ የግላዊነት አቅም

source: Practice your exactitude with every bookmark manager <a href="%(url)s">add-on</a> you can think of, from full page snapshots to quick-switch sidebars to locked-down-tight private bookmarks.
am: የዕልባት መቆጣጠሪያን በደንብ ይለማመዱት <a href="%(url)s">add-on</a> ፤ ሙሉ ገፁን ማስቀመጥ፣ ፈጣን የዕልባት ማውጫን እና የግላዊ ዕልባት መቆለፊያን አጠቃቀም ይወቁ።

source: Private Browsing with Tracking Protection
am: የግላዊነት ማሰሻ ከሰርጎ-ገቦች ክትትል የፀዳ

source: Securely sync your passwords, bookmarks and tabs across all your devices. Get a Firefox Account now – One login – Power and privacy everywhere.
am: በአስተማማኝ መንገድ የይለፍ ቃል፣ እልባቶች እና ትሮችን ሁሉንም በሚጠቀሙበት መሳሪያ ላይ ማዛመድ ይችላሉ። የፋየርፎክስ መታወቂያ አሁን ይውሰዱ - አንድ መግቢያ - አቅምና ደህንነት በሁሉም ቦታ።

source: See if you’ve been involved in an online data breach.
am: በኢንተርኔት መረጃ ማጭበርበር ላይ ተሳትፈው ከሆነ ይመልከቱ።

source: See what’s being blocked
am: የታገዱትን ዝርዝሮች ይመልከቱ

source: Select your preferred installer
am: የሚፈልጉትን ማቀናጃ ይምረጡ

source: Share large files without prying eyes.
am: በርካታ መረጃዎችን ያለስጋት ይለዋወጡ።

source: Sign In
am: ግባ

source: Sign In to Monitor
am: ወደ ሞኒተር ይግቡ

source: Speed up your computer
am: የኮምፒውተርዎን ፍጥነት ይጨምሩ

source: Stop running out of memory
am: የማህደረ ትውስታ ቦታን በሙሉ አይጨርሱ

source: <strong>Firefox Lockwise</strong> makes the passwords you save in Firefox available on all your devices.
am: <strong>ፋየርፎክስ መቆለፊያ</strong> በፋየርፎክስ ላይ የመዘገቡትን የይለፍ-ቃል በሚጠቀሙበት መሳሪያ ሁሉም ቦታዎች ላይ ተደራሽ እንዲሆኑ ያደርጋል።

source: <strong>Private Browsing</strong> clears your history to keep it secret from anyone who uses your computer.
am: <strong>ግላዊ ድረ-ገፅ ማሰሻ</strong> የጎበኙትን ድረ-ገፅ ትውስታዎች ሁሉ በማጥፋት፥ ኮምፒተሩን የሚጠቀም ሌላ ሰው እንዳያገኛቸው ያደርጋል።

source: Take less.<br> Keep it safe.<br> No secrets.
am: ማንም የማይወስደው።<br> ደህንነቱ የተጠበቀ።</br> ምንም ሚስጥር የለም።

source: Take our latest experimental features for a spin and shape the future of Firefox.
am: የእኛን ፈጣን የባህርይ ባህሪያትን ለማጥመድ እና የፋየርፎክስን የወደፊት ሁኔታ ቅርፅ ይውሰዱ

source: Take your favorites on the fly. Use Firefox Sync to access your bookmarks across all your devices, from desktop to mobile. Or try <a href="%(url)s">Pocket</a> to save any online article, or page and come back to later – even without internet.
am: ዕልባቱን ከናንተ ጋር ተንቀሳቃሽ አድርጉት። ፋየርፎክስ ማጣመጃን በመጠቀም ዕልባቶችን በሁሉም የመገልገያ መሳሪያችሁ ማግኘት ትችላላችሁ። ወይም ድረ-ገፁን በ <a href="%(url)s">ኪስ</a> ውስጥ በማስቀመጥ፤ ኢንተርኔት ባይኖር እንኳን የፈለጋችሁትን ፅሁፍ ማንበብ ትችላላችሁ።

source: Take your stand against an industry that’s making you the product.
am: የእርስዎን መረጃዎች እንደግል ንብረታቸው እና ለማስታወቂያ በሚጠቀሙ ድርጅቶች ላይ አቋምዎን ይውሰዱ።

source: Test your sites against soon-to-be-released Firefox browser features with powerful, flexible DevTools that are on by default.
am: በቅርቡ የሚለቀቀውን ፋየርፎክስ ድረ-ገፅ ማሰሻ ገፅታዎች፤ ከፍተኛ አቅም እና ተስማሚ የዴቭቱል ግብአቶቹ ጋር በቀላሉ ድረ-ገፅዎ ላይ ይሞክሩት።

source: Thanks for choosing Firefox!
am: ፋየርፎክስን ስለመረጡ እናመሰግናለን!

source: The best Firefox ever
am: ከምንጊዜውም የተሻለ ፋየርፎክስ

source: The Facebook Container Extension is not available on mobile devices.
am: የፌስቡክ መያዣ ቅጥያ በሞባይል መሣሪያዎች ላይ አይገኝም።

source: The new <strong>Firefox</strong>
am: አዲሱ <strong>ፋየርፎክስ</strong>

source: There is a way to protect your privacy. Join Firefox.
am: ግላዊነትዎን የሚጠብቁበት ዘዴ ያገኛሉ። ፋየርፎክስን ያግኙ።

source: There is a way to protect your privacy. <span>Join Firefox.</span>
am: ግላዊነትዎን የሚጠብቁበት ዘዴ ያገኛሉ። <span>ፈየርፎክስን ያግኙ</span>

source: These ads might be loud video ads, ads that follow you around the web, trackers, third-party cookies, and more. To use an ad blocker, you can search for ad blocker add-ons that are available in your browser. <a href="%(firefox)s">Firefox</a>, for example, has <a href="%(addons)s">this list of approved ad blocker add-ons</a>. Click on this list (or ad blockers that are approved for your browser) and see which fits your needs.
am: እነዚህ ማስታወቂያዎች ከፍተኛ የቪዲዮ ማስታወቂያዎች ፣ በድር ዙሪያ እርስዎን የሚከተሉ ማስታወቂያዎች ፣ ትራከሮች ፣ የሶስተኛ ወገን ኩኪዎች እና ሌሎችም ሊሆኑ ይችላሉ ፡፡ የማስታወቂያ ማገጃን ለመጠቀም በአሳሽዎ ውስጥ የሚገኙትን የማስታወቂያ ማገጃ ተጨማሪዎች መፈለግ ይችላሉ ፡፡ ለምሳሌ ‹a href="%(firefox)s"> ፋየርፎክስ </a> ፣ <a href="%(addons)s"> ይህ የጸደቁ የማስታወቂያ አጋጆች ተጨማሪዎች </a> አለው። በዚህ ዝርዝር ላይ ጠቅ ያድርጉ (ወይም ለአሳሽዎ የጸደቁ የማስታወቂያ አጋጆች) እና ከፍላጎቶችዎ ጋር የሚስማማውን ይመልከቱ ፡፡

source: The second is not storing too much user data. Hackers can’t steal what’s not there, which is why Firefox keeps a minimum amount of information about its users. <a href="%(data)s">Firefox knows</a> if you use the browser and your general location <a href="%(privacy)s">but not the name of your childhood pet or your favorite color.</a>
am: ሁለተኛው ደግሞ በርካታ መረጃዎችን አለማከማቸት ነው። ጠላፊዎች እዚያ ያልተቀመጠ ነገርን ሊሰርቁ አይችሉም፤ ለዚህ ነው ፋየርፎክስ የተጠቃሚዎችን የተወሰኑ መረጃዎች ብቻ የሚይዘው። <a href=%(data)s">ፋየርፎክስ ያውቀዋል</a> ይኼን ድረ-ገፅ ማሰሻን ሲጠቀሙ እና ያሉበትን አካበቢ ጭምር <a href="%(privacy)s">ነገር ግን የውሻዎትን ስም እና የቀለም ምርጫዎትን ጭምር ያውቃል ማለት አይደለም።</a>

source: The standard Firefox browser — fast and private. If you’re not sure which Firefox to choose, choose this.
am: ደረጃውን የጠበቀ የፋየርፎክስ ድረ-ገፅ ማሰሻ - ፈጣን እና አስተማማኝ። የትኛውን ፋየርፎክስ እንደሚመርጡ እርግጠኛ ካልሆኑ፤ ይኼን ይምረጡ።

source: This is one of the many reasons to choose the Firefox browser: Firefox blocks third-party trackers by default. We have other reasons and we’ll get into those later.
am: ይኼ እንግዲህ ፋየርፎክስ ድረ-ገፅ ማሰሻን ከምንመርጥበት በርካታ ምክንያቶች አንዱ ነው: ፋየርፎክስ በነባሪነት የሶስተኛ ወገን ዱካን ያግዳል። ሌሎች ምክንያቶችም አሉ እነሱን በኋላ እንመለስበታለን።

source: Today is a different story. Ads, privacy hacks, security breaches, and fake news might have you looking at other qualities in a browser. How does the browser protect your privacy? Does it allow trackers to follow you across the web? Does it built to multitask and handle many computer and internet operations at once?
am: ዛሬ ግን የተለየ ትርክት ነው ያለው። ማስታወቂያ፣ የግለሰብ መረጃዎችን መጥለፍ፣ ማጭበርበር እና ሀሰተኛ ዜናዎች ልናተኩርባቸው የሚገቡ የአንድ ድረ-ገፅ ማሰሻ የጥራት መለኪያዎች ሆነዋል። እንዴት ነው አንድ የድረ-ገፅ ማሰሻ ደህንነትዎን ሊያስጠብቅ የሚችለው? ኢንተርኔት ሲጠቀሙ ሰርጎ-ገቦች የእርስዎን ዱካ እንዲከታተሉ ይፈቅዳል? አሠራሩ ዘርፈ-ብዙ ሥራዎችን ለመከወን፣ ባንድ ጊዜ ብዙ ኮምፒውተሮችን ለመያዝ እና የተለያዩ የኢንተርኔት አገልግሎቶችን ለመጠቀም ያስችላል ወይ?

source: Travel the internet with protection, on every device.
am: በማንኛውም መገልገያ መሳሪያ ኢንተርኔት ላይ በጥንቃቄ ይጓዙ።

source: Truly Private Browsing with Tracking Protection
am: ሀቀኛ የግላዊነት ማሰሻ ከሰርጎ-ገቦች ክትትል የፀዳ

source: Try New Browser Features in Pre-Release Versions | Firefox
am: ቅድመ-ልቀቅ ቨርዥንስ ፋየርፎክስ ውስጥ አዲስ የአሳሽ ባህሪያት ይሞክሩ

source: Try New Features in a Pre-Release Android Browser | Firefox
am: በቅድመ-ልቀቅ አንሮይድ አሳሽ |ፋየርፎክስ ውስጥ አዳዲስ ባህሪያት ይሞክሩ

source: Try New Features in a Pre-Release iOS Browser | Firefox
am: ቅድመ-መልቀቂያ ውስጥ አዲስ ባህሪያት ይሞክሩ iOS አሳሽ | ፋየርፎክ

source: Try <strong>Firefox Focus</strong>, the privacy browser for Android and iOS.
am: ይኼን <strong>ፋየርፎክስ አትኩሮት</strong> ይሞክሩት፤ የግላዊነት ማሰሻ ለአንድሮይድ እና iOS።

source: Use less memory
am: ትንሽ የማህደረ ትውስታ ቦታን ይጠቀማል

source: Uses 30% less memory than Chrome
am: ከክሮም በ 30% ያነሰ የትውስታ ቦታ የሚፈልግ

source: We led the tech to run 3D games at near-native speeds, and now Firefox is bringing better performance to online gaming. Our powerful browser reduces lags, speeds up ping times and optimizes overall gameplay through faster, leaner browsing.
am: እኛ የ 3D ጨዋታ ቴክኖሎጂን በተለመደው ፍጥነት በማስኬድ ቀዳሚ ነን፤ በቀጥታ በኢንተርኔት ላይ በተሻለ ብቃት ጨዋታዎችን ለመጫወት ያስችላል። የኛ ከፍተኛ አቅም ያለው ማሰሻ መዘግየቱን ይቀንሳል፣ የጨዋታውን ፍጥነት ይጨምራል እንዲሁም በፈጣንና በትንሽ ማሰሻ የማጫወቻውን አጠቃላይ ብቃት ከፍ ያደርጋል።

source: We’re backed by <a href="%(mozilla)s">Mozilla</a>, the not-for-profit organization that puts people over profit to give everyone more power online. We created this extension because we believe that you should have easy-to-use tools that help you manage your privacy and security.
am: እኛ የምንደገፈው በ <a href="%(mozilla)s">ሞዚላ</a> ሲሆን፤ ለትርፍ ያልተቋቋመ፣ የህዝብን የኢንተርኔት አጠቃቀም አቅም ለመጨመር የሚሠራ ድርጅት ነው። ይኼንን ቅጥያ የፈጠርንበት ዋናው ምክንያት፤ የርስዎን ደህነነትና ግላዊነት የሚጠብቁበት ለአጠቃቀም ቀላል የሆነ መገልገያ ያስፈልግዎታል ብለን ስላሰብን ነው።

source: We support communities all over the world standing up for a healthier internet. Add your voice to the fight.
am: በመላው አለም ያሉ ህዝቦች አስተማማኝ የኢንተርኔት አገልግሎት እንዲያገኙ ለማድረግ እንሠራለን። እርስዎም ከጎናችን ይቁሙ።

source: We’ve been working out, so you can get more done.
am: በብቃት እየሠራን ስለሆነ፤ የበለጠ መሥራት ያስችልዎታል።

source: Which browser would you like to download?
am: የትኛውን ድረ-ገፅ ማሰሻ ለመጫን ይፈልጋሉ?

source: Which version would you like?
am: የትኛውን የምርት ስሪት ይፈልጋሉ?

source: Windows installers for corporate IT that simplify the configuration, deployment and management of the Firefox Browser.
am: ዊንዶውስ ማቀናጃ ለIT ድርጅቶች፤ የፋየርፎክስ ድረ-ገፅ ማሰሻን ሲጠቀሙ ቅንጅትን፣ ስርጭትን እና አስተዳደርን ያቀልላቸዋል።

source: You are about to download:
am: አሁን ለመጫን ተቃርበዋል:

source: You’ll always get the truth from us. Everything we make and do honors our <a href="%(promise)s">Personal Data Promise</a>:
am: ሁልጊዜም ከእኛ ሀቀኛ አገልግሎትን ያገኛሉ። የምንሠራውና የምናደርገው ሁሉ <a href=%(promise)s">ግላዊ መረጃን መጠበቅ</a>: የሚለውን መርህ በማክበር ነው።

source: You’re signed <br>in to Firefox. <br><span>Now try Firefox Monitor.</span>
am: መታወቂያ አግኝተዋል <br>የፋየርፎክስ <br><span>አሁን ፋየርፎክስ ሞኒተርን ይሞክሩ።</span>

source: 12 Month
am: 12 ወር

source: 12 Month plan
am: የ 12 ወር እቅድ

source: 30-day money-back guarantee
am: የ 30 ቀን ገንዘብ ተመላሽ ዋስትና

source: About { -brand-name-firefox } and { -brand-name-mozilla }
am: ስለ { -brand-name-firefox } እና { -brand-name-mozilla }

source: About our trusted partner
am: ስለ ታማኝ አጋራችን

source: About this site
am: ስለዚህ ድረ-ገፅ

source: Access all of { -brand-name-firefox } with a single login — and get more from every product when you do.
am: ሁሉንም { -brand-name-firefox } በአንድ መግቢያ ይድረሱባቸው - ይህን ሲያደርጉ ከእያንዳንዱ ምርት ተጨማሪ ያግኙ።

source: Access and sync your bookmarks, passwords, open tabs and more — everywhere you use { -brand-name-firefox }.
am: በማንኛውም ቦታ { -brand-name-firefox }ን ሲጠቀሙ — የእርስዎን ዕልባቶች፣ የይለፍ ቃሎች፣ ክፍት ትሮች እና ሌሎችንም ያግኙ እና ያመሳስሉ።

source: Access to servers in { $countries }+ countries
am: በ { $countries }+ አገሮች ውስጥ ያሉ አገልጋዮች መዳረሻ

source: Actively improve { -brand-name-mozilla } products by contributing to a variety of development opportunities.
am: ለተለያዩ የልማት እድሎች በማበርከት የ{ -brand-name-mozilla } ምርቶችን በንቃት ያሻሽሉ።

source: Add { -brand-name-firefox-relay } to your subscription to protect your email and phone number. <a href="{ $url }">Learn more</a>.
am: የእርስዎን ኢሜይል እና ስልክ ቁጥር ለመጠበቅ { -brand-name-firefox-relay }ን ወደ ምዝገባዎ ያክሉ። <a href="{ $url }">የበለጠ ለመረዳት</a>።

source: Addons
am: ተጨማሪዎች

source: Add <span class="{ $class_name }">{ -brand-name-firefox-relay }</span>
am: <span class="{ $class_name }">{ -brand-name-firefox-relay }</span> አክል

source: Ad tracker blocking
am: የማስታወቂያ መከታተያ ማገድ

source: Ad Tracker Blocking
am: ማስታወቂያ ተከታታይን ማገድ

source: After several years of development, <a href="{ $mozilla1 }">{ -brand-name-mozilla } 1.0</a>, the first major version, was released in 2002. This version featured many improvements to the browser, email client and other applications included in the suite, but not many people were using it.
am: ከብዙ ዓመታት እድገት በኋላ <a href="{ $mozilla1 }">{ -brand-name-mozilla } 1.0</a>፣ የመጀመሪያው ዋና ስሪት በ2002 ተለቀቀ። ይህ ስሪት ብዙ ማሻሻያዎችን በአሳሹ፣ የኢሜል ማደራጃ እና ሌሎች በስብስቡ ውስጥ የተካተቱ መተግበሪያዎች ላይ አሳይቷል፤ ነገር ግን ብዙ ሰዎች እየተጠቀሙበት አልነበረም።

source: A great internet browser should have the functionality you need, portability across devices, and the privacy you deserve.
am: በጣም ጥሩ የበይነመረብ አሳሽ የሚፈልጉትን ተግባር፣ በመሳሪያዎች ላይ ተንቀሳቃሽነት እና የሚገባዎትን ግላዊነት ሊኖረው ይገባል።

source: <a href={ $explore }>Explore</a> the entire family for { -brand-name-firefox } products designed to respect your privacy.
am: የእርስዎን ግላዊነት ለማክበር የተነደፉ የ{ -brand-name-firefox } ምርቶችን ለማግኘት <a href={ $explore }>አስስ</a>።

source: <a href="{ $firefox1 }">{ -brand-name-firefox } 1.0</a> was released in 2004 and became a big success — in less than a year, it was downloaded <a href="{ $millions }">over 100 million times</a>.
am: <a href="{ $firefox1 }">{ -brand-name-firefox } 1.0</a> በ2004 ተለቀቀ እና ትልቅ ስኬት ሆነ - አንድ አመት ባልሞላ ጊዜ ውስጥ"<a href="{ $millions }">ከ100 ሚሊዮን ጊዜ በላይ ወርዷል።</a>

source: <a href="{ $link }">The History of { -brand-name-firefox } and { -brand-name-mozilla } Posters</a> (available in English and Japanese)
am: <a href="{ $link }">የ{ -brand-name-firefox } እና { -brand-name-mozilla } ፖስተሮች</a> ታሪክ (በእንግሊዝኛ እና በጃፓንኛ ይገኛል)

source: <a href="{ $password }">Save and sync passwords</a>
am: <a href="{ $password }">የይለፍ ቃል አስቀምጥ እና አሰናስል</a>

source: <a href="{ $send }">Send a tab</a> to a different device
am: ወደ ሌላ መሣሪያ <a href="{ $send }">ትር ላክ</a>

source: <a href="{ $url }">{ -brand-name-mozilla } no longer provides security updates for { -brand-name-firefox } on { -brand-name-windows } { -brand-name-xp } or { -brand-name-vista }</a>, but you can still download the final { -brand-name-windows } 32-bit version below.
am: <a href="{ $url }">{ -brand-name-mozilla } የጥንቃቄ እና ደህንነት ማሻሻያዎችን { -brand-name-firefox } በ { -brand-name-windows }{ -brand-name-xp } ወይም { -brand-name-vista }</a> ላይ መስጠት አቁሟል፤ ነገር ግን አሁንም የመጨረሻውን ስሪት ለ{ -brand-name-windows }32-ቢት ቨርዥን መጫን ይችላሉ።

source: All of our plans include:
am: ሁሉም እቅዶቻችን የሚከተሉትን ያካትታሉ:-

source: Almost all of the browsers compared here allow synchronization between desktop and mobile devices. You’ll need an account to do it, which you can use to log into the browser on all devices and synchronize things like passwords, browsing history, bookmarks and settings.
am: ከሞላ ጎደል ሁሉም እዚህ የተነፃፀሩት አሳሾች በዴስክቶፕ እና በሞባይል መሳሪያዎች መካከል ማሰናሰልን ይፈቅዳሉ። ይህንን ለማድረግ በሁሉም መሳሪያዎች ላይ ወደ አሳሹ ለመግባት እና እንደ የይለፍ ቃላት ፣ የአሰሳ ታሪክ ፣ ዕልባቶች እና ቅንብሮች ያሉ ነገሮችን ለማሰናሰል የሚጠቀሙበት መለያ ያስፈልግዎታል።

source: Almost needless to say, versions of both { -brand-name-firefox } and { -brand-name-chrome } are available for the most popular desktop and mobile operating systems ({ -brand-name-windows }, { -brand-name-mac }, { -brand-name-linux }, { -brand-name-android }, { -brand-name-ios }).
am: የሁለቱም የ{ -brand-name-firefox } እና { -brand-name-chrome } ስሪቶች በጣም ታዋቂ ለሆኑ የዴስክቶፕ እና የሞባይል ኦፕሬቲንግ ሲስተሞች ({ -brand-name-windows }፣ { -brand-name-mac }፣ { -brand-name-linux }፣ { -brand-name-android }፣ { -brand-name-ios }) ይገኛሉ ማለት ይቻላል።

source: Already a subscriber?
am: አስቀድመው ተመዝጋቢ ነዎት?

source: Already have an account? <a { $fxa_attr }>Sign in</a> or <a { $accounts_attr }>learn more</a> about joining { -brand-name-firefox }.
am: አስቀድሞ መለያ አለዎት? <a { $fxa_attr }>ይግቡ</a> ወይም { -brand-name-firefox }ን ስለመቀላቀል <a { $accounts_attr }>ተጨማሪ ይወቁ</a>።

source: Already have an account? <a { $fxa_attr }>Sign In</a> or <a { $accounts_attr }>learn more</a> about joining { -brand-name-firefox }.
am: አስቀድሞ መለያ አለዎት? <a { $fxa_attr }>ይግቡ</a> ወይም { -brand-name-firefox }ን ስለመቀላቀል <a { $accounts_attr }>ተጨማሪ ይወቁ</a>።

source: Also available for:
am: እንዲሁም ለ:

source: Although not as extensive as { -brand-name-chrome }’s add-on library, { -brand-name-firefox }, as open-source software with a huge number of active contributors, also features an incredible number of useful extensions.
am: ምንም እንኳን የ{ -brand-name-chrome }ን ተጨማሪ መዛግብት ያህል ሰፊ ባይሆንም፣ { -brand-name-firefox } ብዛት ያላቸው ንቁ አስተዋጽዖ አበርካቾች እንዳሉት ክፍት ምንጭ ሶፍትዌር፣ እጅግ አስደናቂ ቁጥር ያላቸው ጠቃሚ ቅጥያዎችን ይዟል።

source: Always evolving
am: ሁልጊዜ በለውጥ ላይ

source: { $amount }<span>/month</span>
am: { $amount }<span> /በወር</span>

source: { $amount }<span>/month + tax</span>
am: { $amount }<span> /በወር+ ግብር</span>

source: { $amount } total
am: { $amount } ጠቅላላ

source: { $amount } total + tax
am: { $amount } ጠቅላላ + ግብር

source: And so here we are, the browser-wars are escalating once again and it’s time to reevaluate and compare { -brand-name-firefox-browser } vs { -brand-name-google } { -brand-name-chrome }.
am: እናም እዚህ ጋ ነን፣ የአሳሽ-ጦርነቶች እንደገና እያደጉ ናቸው እና { -brand-name-firefox-browser }ን ከ { -brand-name-google } { -brand-name-chrome } እንደገና ለመገምገም እና ለማወዳደር ጊዜው አሁን ነው።

source: And the winner is…
am: እና አሸናፊው…

source: An even newer { -brand-name-firefox } is available. <a href="{ $url }">Update to the latest version</a>
am: የበለጠ አዲስ { -brand-name-firefox } አለ። <a href="{ $url }">ወደ የቅርብ ጊዜው ስሪት ያዘምኑ</a>

source: An even newer { -brand-name-firefox } is available. Restart to update.
am: የበለጠ አዲስ { -brand-name-firefox } አለ። ለማዘመን እንደገና ያስጀምሩ።

source: Another browser feature that should be a given is the ability to prevent websites and companies from tracking your browsing and shopping data — even in normal browsing mode.
am: ሌላው መሰጠት ያለበት የአሳሽ ባህሪ ድረ-ገጾች እና ኩባንያዎች የእርስዎን የአሰሳ እና የግዢ ውሂብ እንዳይከታተሉ የመከላከል ችሎታ ነው - በተለመደው የአሰሳ ሁነታም ቢሆን።

source: Another browser feature that should be a given is the ability to prevent websites and companies from tracking your browsing and shopping data — even in normal browsing mode. But that’s actually not the case: in fact, the only browsers that block third party tracking cookies by default are { -brand-name-firefox } and { -brand-name-safari }.
am: ሌላው መሰጠት ያለበት የአሳሽ ባህሪ ድረ-ገጾች እና ኩባንያዎች የእርስዎን የአሰሳ እና የግዢ ውሂብ እንዳይከታተሉ የመከላከል ችሎታ ነው - በተለመደው የአሰሳ ሁነታም ቢሆን። ግን እውነታው ያ አይደለም፤ በእርግጥ የሶስተኛ ወገን ኩኪዎችን በነባሪነት የሚከለክሉት አሳሾች { -brand-name-firefox } እና { -brand-name-safari } ናቸው።

source: Approach your career with a sense of purpose. Find worthy work at { -brand-name-mozilla }.
am: በዓላማ ስሜት ወደ ሥራዎ ይቅረቡ። በ{ -brand-name-mozilla } ላይ ብቁ ስራ ያግኙ።

source: ARM64/AArch64 installers optimized for Snapdragon-powered { -brand-name-windows } PCs.
am: ARM64/AArch64 ጫኚዎች በSnapdraptop ለሚሰሩ { -brand-name-windows } PCs የተመቻቹ።

source: Article helpful
am: አጋዥ ጽሑፍ

source: Article not helpful
am: ጽሑፉ አጋዥ አይደለም

source: As alluded to before, { -brand-name-apple } is one of those companies that recently decided to step up their privacy game. Not long ago, { -brand-name-apple } implemented cross-site tracking prevention in { -brand-name-safari }, which prevents ads from following you around the internet. { -brand-name-safari } also offers a strong password suggestion when you sign up for a new account on any website. And if you’re invested in the iCloud ecosystem, it syncs that password securely with your other devices, so you never actually have to remember it.
am: ቀደም ሲል እንደተጠቀሰው፣ { -brand-name-apple } በቅርቡ የግላዊነት ጨዋታቸውን ከፍ ለማድረግ ከወሰኑ ኩባንያዎች አንዱ ነው። ከቅርብ ጊዜ በፊት፣ { -brand-name-apple } በ{ -brand-name-safari } ውስጥ የጣቢያ-አቋራጭ መከታተያ መከላከልን ተግባራዊ አድርጓል፣ይህም ማስታወቂያዎች በበይነመረብ ዙሪያ እርስዎን እንዳይከተሉዎት ይከለክላል። በማንኛውም ድር ጣቢያ ላይ ለአዲስ መለያ ሲመዘገቡ { -brand-name-safari } ጠንካራ የይለፍ ቃል ጥቆማ ይሰጣል። እና በ iCloud ስነ-ምህዳር ውስጥ ኢንቨስት ካደረጉ፣ ያንን የይለፍ ቃል ከሌሎች መሳሪያዎችዎ ጋር ደህንነቱ በተጠበቀ ሁኔታ ያመሳስለዋል፣ ስለዚህ በጭራሽ ማስታወስ የለብዎትም።

source: As far as actual privacy protections in the { -brand-name-opera } browser, it does offer a robust Private mode that allows you to surf the web without the browser tracking your activity. Also in normal browsing mode, you can also turn off some data collection features by digging into the settings to enable the ad blocker and adjust other security features.
am: በ{ -brand-name-opera } አሳሽ ውስጥ ያሉ ትክክለኛ የግላዊነት ጥበቃዎች፣ አሳሹ እንቅስቃሴዎን ሳይከታተል ድሩን እንዲያንሸራትቱ የሚያስችል ጠንካራ የግል ሁነታን ይሰጣል። እንዲሁም በተለመደው የአሰሳ ሁነታ የማስታወቂያ ማገጃውን ለማንቃት እና ሌሎች የደህንነት ባህሪያትን ለማስተካከል ወደ ቅንጅቶቹ ውስጥ በመግባት አንዳንድ የውሂብ መሰብሰቢያ ባህሪያትን ማጥፋት ይችላሉ።

source: As far as security goes, { -brand-name-firefox } is solid there as well. Any time you’re in { -brand-name-firefox }, you can right-click in the password field to securely generate a strong password using the Fill Password option. When you save your new password, we will prompt you to save to its built-in password manager, <a { $lockwise }>{ -brand-name-lockwise }</a>. We also serve up users and account holders with another free and useful product called <a { $monitor }>{ -brand-name-monitor }</a> that automatically alerts you if your data is included in a known data breach.
am: ደህንነት እስካለው ድረስ፣ { -brand-name-firefox } እዚያም ጠንካራ ነው። በማንኛውም ጊዜ በ{ -brand-name-firefox } ውስጥ ሲሆኑ፣ የይለፍ ቃል ሙላ አማራጭን በመጠቀም ጠንካራ የይለፍ ቃል ደህንነቱ በተጠበቀ ሁኔታ ለማመንጨት በይለፍ ቃል መስኩ ላይ በቀኝ ጠቅ ማድረግ ይችላሉ። አዲሱን የይለፍ ቃልዎን ሲያስቀምጡ አብሮ በተሰራው የይለፍ ቃል አቀናባሪው <a { $lockwise }>{ -brand-name-lockwise }</a> ላይ እንዲያስቀምጡ እንጠይቅዎታለን። እንዲሁም ተጠቃሚዎችን እና የመለያ ባለቤቶችን የታወቀ የውሂብ ጥሰት መኖሩን በራስ ሰር የሚያነቃ ነፃ እና ጠቃሚ የሆነ <a { $monitor }>{ -brand-name-monitor }</a> የሚባል ምርት እናቀርባለን።

source: As for customization, our fans will tell you one of the things they love most about our browser is its ability to allow you to move and arrange a majority of the UI elements to best suit your needs. { -brand-name-chrome } allows you to hide certain UI elements but there’s not much allowance, if any, for moving things around based on your preferences. However, it should be noted that both { -brand-name-chrome } and { -brand-name-firefox } make it pretty easy to change your browser’s appearance and theme.
am: ማበጀትን በተመለከተ፣ ደጋፊዎቻችን ስለ አሳሽችን በጣም ከሚወዷቸው ነገሮች ውስጥ አንዱ እርስዎ እንዲንቀሳቀሱ መፍቀድ እና አብዛኛዎቹን UI ክፍሎችን ለፍላጎትዎ በተሻለ ሁኔታ እንዲያሟሉ ማድረጉ ነው። { -brand-name-chrome } የተወሰኑ የUI ክፍሎችን እንዲደብቁ ይፈቅድልዎታል ነገር ግን በምርጫዎ መሰረት ነገሮችን ለማንቀሳቀስ ብዙ አበል የለም። ነገር ግን፣ ሁለቱም { -brand-name-chrome } እና { -brand-name-firefox } የአሳሽዎን መልክ እና ገጽታ ለመለወጥ በጣም ቀላል እንደሚያደርጉት ልብ ሊባል ይገባል።

source: Aside from sucking up a lot of computing power, { -brand-name-edge } running on { -brand-name-chromium } has answered a lot of users’ needs for functionality and features. But there’s still a lot to account for in terms of the browser’s privacy protections. It’s our assessment that { -brand-name-firefox } is still a better choice for most people to use in their daily lives, based not only on functionality but more importantly on our transparency in how we collect user data, what exactly we collect, and what we do with it. Because our parent company is <a { $attrs }>{ -brand-name-mozilla }</a>, a non-profit organization dedicated to internet privacy and freedom, we simply have a different set of priorities when it comes to users’ data.
am: ብዙ የማስላት ሃይል ከመምጠጥ በተጨማሪ፣ { -brand-name-edge } በ{ -brand-name-chromium } ላይ በመስራት የበርካታ ተጠቃሚዎችን የተግባር እና ባህሪያትን ፍላጎቶች መልሷል። ነገር ግን አሁንም ከአሳሹ የግላዊነት ጥበቃ አንፃር ብዙ መለያዎች አሉ። የእኛ ግምገማ ነው { -brand-name-firefox } ለአብዛኛዎቹ ሰዎች በዕለት ተዕለት ሕይወታቸው ለመጠቀም አሁንም የተሻለ ምርጫ ነው፣ በተግባራዊነት ላይ ብቻ ሳይሆን በይበልጥም የተጠቃሚን መረጃ እንዴት እንደምንሰበስብ፣ በትክክል የምንሰበስበው፣ እና ምን እንደምናደርግ። ምክንያቱም የኛ ወላጅ ኩባንያ <a { $attrs }>{ -brand-name-mozilla }</a> ለበይነመረብ ግላዊነት እና ነፃነት የተሰጠ ለትርፍ ያልተቋቋመ ድርጅት ስለሆነ በቀላሉ ከተጠቃሚዎች ውሂብ ጋር በተያያዘ የተለየ ቅድሚያ የሚሰጣቸው ነገሮች አለን።

source: A sustainable organization has been created that uses market mechanisms to support a public benefit mission and this model has been reused by others to create open, transparent and collaborative organizations in a <a href="{ $range }">broad range</a> <a href="{ $areas }">of areas</a>.
am: የህዝብ ተጠቃሚነት ተልዕኮን ለመደገፍ የገበያ ዘዴዎችን የሚጠቀም ዘላቂ ድርጅት ተፈጥሯል እና ይህ ሞዴል በሌሎችም እንደገና ተጠቅሞ ክፍት፣ ግልጽ እና የትብብር ድርጅቶችን በ<a href="{ $range }">በስፋት የሚያካልል</a > <a href="{ $areas }">አካባቢዎች</a>።

source: At { -brand-name-firefox }, our <a { $attrs }>privacy policy</a> is transparent and in plain language. We actually put a lot of work into making sure it was straightforward and easy to read. We pride ourselves in protecting our users security and privacy. With Enhanced Tracking Protection now on by default, we block 2000+ trackers automatically. Trackers are those little pieces of code that try to piece together what you’re doing across multiple internet sites to build a composite and detailed picture of who you are, compromising your privacy all just to target better ads.
am: በ{ -brand-name-firefox } ላይ የእኛ <a { $attrs }>የግላዊነት መመሪያ</a> ግልጽ እና ግልጽ የሆነ ቋንቋ ነው። ቀጥተኛ እና ለማንበብ ቀላል መሆኑን ለማረጋገጥ ብዙ ስራ ሰርተናል። የተጠቃሚዎቻችንን ደህንነት እና ግላዊነት በመጠበቅ እራሳችንን እናኮራለን። በተሻሻለ የክትትል ጥበቃ አሁን በነባሪ፣ 2000+ መከታተያዎችን በራስ ሰር እንገድባለን። ትራከሮች እነዚ ትንንሽ የኮድ ቁራጮች ናቸው እርስዎ በተለያዩ የኢንተርኔት ድረ-ገጾች ላይ እያደረጉ ያለውን ነገር አንድ ላይ ለማጣመር የሚሞክሩት እርስዎ ማን እንደሆኑ የተቀነባበረ እና ዝርዝር ምስል ለመገንባት ሲሆን፣ ይህም የተሻሉ ማስታወቂያዎችን ለማነጣጠር ብቻ ግላዊነትዎን የሚያስሱ ናቸው።
